Revit 2024 API
Hardwood.HardwoodFinish Property
 The property labeled "Finish" from the "Hardwood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string HardwoodFinish { get; }
Visual Basic
Public Shared ReadOnly Property HardwoodFinish As String
	Get
Visual C++
public:
static property String^ HardwoodFinish {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "HardwoodFinishType".
See Also
Hardwood Class
Autodesk.Revit.DB.Visual Namespace